Моя_подготовка_БУДЗ3/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>CatalogRef.СвойстваНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Моя_подготовка_БУДЗ3/src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Управленческий</name>
  <chartOfAccounts>ChartOfAccounts.Управленческий</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Управленческий.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
</mdclass:AccountingRegister>

Моя_подготовка_БУДЗ3/src/ChartsOfAccounts/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Управленческий</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>01</code>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>01.01</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>01.02</code>
      </childItems>
      <childItems>
        <name>ТоварыВПути</name>
        <description>Товары в пути</description>
        <code>01.03</code>
      </childItems>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>01.04</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>ОсновноеПроизводство</name>
        <description>Основное производство</description>
        <code>01.05</code>
      </childItems>
      <childItems>
        <name>ОбщехозяйственныеЗатраты</name>
        <description>Общехозяйственные затраты</description>
        <code>01.06</code>
      </childItems>
      <childItems>
        <name>КредитыИЗаймыВыданные</name>
        <description>Кредиты и займы выданные</description>
        <code>01.07</code>
      </childItems>
      <childItems>
        <name>Материалы</name>
        <description>Материалы</description>
        <code>01.08</code>
      </childItems>
    </items>
    <items>
      <name>Обязательства</name>
      <description>Обязательства</description>
      <code>02</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Сотрудники</name>
        <description>Сотрудники</description>
        <code>02.01</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>02.02</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>КредитыИЗаймыПолученные</name>
        <description>Кредиты и займы полученные</description>
        <code>02.03</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Налоги</name>
        <description>Налоги</description>
        <code>02.04</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ПрибылиУбытки</name>
      <description>Прибыли убытки</description>
      <code>03</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Моя_подготовка_БУДЗ3/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.СвойстваНоменклатуры</types>
  </type>
  <predefined>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Свойство</name>
      <description>Свойство</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.СвойстваНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>Склад</name>
      <description>Склад</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Моя_подготовка_БУДЗ3/src/Documents/РасходнаяНакладная/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Управленческий.Записывать = Истина;
	Движения.Управленческий.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.Управленческий");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ПолеПространстваБлокировки = "Субконто"
		+ ПланыСчетов.Управленческий.Товары.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Склад).НомерСтроки;
	ЭлементБлокировки.УстановитьЗначение(ПолеПространстваБлокировки, Склад);
	ЭлементБлокировки.УстановитьЗначение("Счет", ПланыСчетов.Управленческий.Товары);
	
	ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура, "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных(ПланыВидовХарактеристик.ВидыСубконто.Свойство, "Свойство");
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.Управленческий");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ПолеПространстваБлокировки = "Субконто"
		+ ПланыСчетов.Управленческий.Материалы.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Склад).НомерСтроки;
	ЭлементБлокировки.УстановитьЗначение(ПолеПространстваБлокировки, Склад);
	ЭлементБлокировки.УстановитьЗначение("Счет", ПланыСчетов.Управленческий.Материалы);
	
	ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура, "Номенклатура");
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура,
		|	РасходнаяНакладнаяСписокНоменклатуры.Свойство,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК ДокументКоличество,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Сумма) КАК ДокументСумма
		|ПОМЕСТИТЬ ДанныеДокумента
		|ИЗ
		|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
		|ГДЕ
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура,
		|	РасходнаяНакладнаяСписокНоменклатуры.Свойство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УправленческийОстатки.Счет КАК Счет,
		|	УправленческийОстатки.Субконто1 КАК Номенклатура,
		|	УправленческийОстатки.Субконто3 КАК Свойство,
		|	УправленческийОстатки.КоличествоОстатокДт КАК КоличествоОстаток
		|ПОМЕСТИТЬ ОстаткиПоСкладам
		|ИЗ
		|	РегистрБухгалтерии.Управленческий.Остатки(
		|			&МоментВремени,
		|			Счет = &СчетТовары,
		|			&СубконтоТовары,
		|			(Субконто1, Субконто2, Субконто3) В
		|				(ВЫБРАТЬ
		|					ДанныеДокумента.Номенклатура,
		|					&Склад,
		|					ДанныеДокумента.Свойство
		|				ИЗ
		|					ДанныеДокумента КАК ДанныеДокумента)) КАК УправленческийОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УправленческийОстатки.Счет,
		|	УправленческийОстатки.Субконто1,
		|	&Свойство,
		|	УправленческийОстатки.КоличествоОстатокДт
		|ИЗ
		|	РегистрБухгалтерии.Управленческий.Остатки(
		|			&МоментВремени,
		|			Счет = &СчетМатериалы,
		|			&СубконтоМатериалы,
		|			(Субконто1, Субконто2) В
		|				(ВЫБРАТЬ
		|					ДанныеДокумента.Номенклатура,
		|					&Склад
		|				ИЗ
		|					ДанныеДокумента КАК ДанныеДокумента)) КАК УправленческийОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УправленческийОстатки.Счет КАК Счет,
		|	УправленческийОстатки.Субконто1 КАК Номенклатура,
		|	УправленческийОстатки.Субконто3 КАК Свойство,
		|	УправленческийОстатки.КоличествоОстатокДт КАК КоличествоСебестоимость,
		|	УправленческийОстатки.СуммаОстатокДт КАК СуммаСебестоимость
		|ПОМЕСТИТЬ Себестоимость
		|ИЗ
		|	РегистрБухгалтерии.Управленческий.Остатки(
		|			&МоментВремени,
		|			Счет = &СчетТовары,
		|			&СубконтоТовары,
		|			(Субконто1, Субконто3) В
		|				(ВЫБРАТЬ
		|					ДанныеДокумента.Номенклатура,
		|					ДанныеДокумента.Свойство
		|				ИЗ
		|					ДанныеДокумента КАК ДанныеДокумента)) КАК УправленческийОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УправленческийОстатки.Счет,
		|	УправленческийОстатки.Субконто1,
		|	&Свойство,
		|	УправленческийОстатки.КоличествоОстатокДт,
		|	УправленческийОстатки.СуммаОстатокДт
		|ИЗ
		|	РегистрБухгалтерии.Управленческий.Остатки(
		|			&МоментВремени,
		|			Счет = &СчетМатериалы,
		|			&СубконтоМатериалы,
		|			(Субконто1, Субконто2) В
		|				(ВЫБРАТЬ
		|					ДанныеДокумента.Номенклатура,
		|					&Склад
		|				ИЗ
		|					ДанныеДокумента КАК ДанныеДокумента)) КАК УправленческийОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДокумента.Номенклатура,
		|	НЕ ДанныеДокумента.Номенклатура.Деталь КАК ЭтоТовар,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДанныеДокумента.Номенклатура) КАК НоменклатураПредставление,
		|	ДанныеДокумента.Свойство,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДанныеДокумента.Свойство) КАК СвойствоПредставление,
		|	ДанныеДокумента.ДокументКоличество,
		|	ДанныеДокумента.ДокументСумма,
		|	ЕСТЬNULL(ОстаткиПоСкладам.КоличествоОстаток, 0) КАК КоличествоПоСкладу,
		|	ЕСТЬNULL(Себестоимость.КоличествоСебестоимость, 0) КАК КоличествоСебестоимость,
		|	ЕСТЬNULL(Себестоимость.СуммаСебестоимость, 0) КАК СуммаСебестоимость
		|ИЗ
		|	ДанныеДокумента КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоСкладам КАК ОстаткиПоСкладам
		|		ПО ДанныеДокумента.Номенклатура = ОстаткиПоСкладам.Номенклатура
		|			И ДанныеДокумента.Свойство = ОстаткиПоСкладам.Свойство
		|		ЛЕВОЕ СОЕДИНЕНИЕ Себестоимость КАК Себестоимость
		|		ПО ДанныеДокумента.Номенклатура = Себестоимость.Номенклатура
		|			И ДанныеДокумента.Свойство = Себестоимость.Свойство";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Свойство", Справочники.СвойстваНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	СубконтоТовары = Новый Массив;
	СубконтоТовары.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	СубконтоТовары.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Склад);
	СубконтоТовары.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Свойство);
	
	СчетТовары = ПланыСчетов.Управленческий.Товары;
	
	Запрос.УстановитьПараметр("СубконтоТовары", СубконтоТовары);
	Запрос.УстановитьПараметр("СчетТовары", СчетТовары);
	
	СубконтоМатериалы = Новый Массив;
	СубконтоМатериалы.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	СубконтоМатериалы.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Склад);
	
	СчетМатериалы = ПланыСчетов.Управленческий.Материалы;
	
	Запрос.УстановитьПараметр("СубконтоМатериалы", СубконтоМатериалы);
	Запрос.УстановитьПараметр("СчетМатериалы", СчетМатериалы);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить(); // Для отладки.
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СуммаПродаж = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокументКоличество = ВыборкаДетальныеЗаписи.ДокументКоличество;
		КоличествоПоСкладу = ВыборкаДетальныеЗаписи.КоличествоПоСкладу;
		
		Если ДокументКоличество > КоличествоПоСкладу Тогда
			Отказ = Истина;
			
			Если ВыборкаДетальныеЗаписи.ЭтоТовар Тогда
				ШаблонСообщения = НСтр("ru = 'По номенклатуре ""%1"" со свойством ""%2"" превышено количество остатка. Остаток: %3'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения,
					ВыборкаДетальныеЗаписи.НоменклатураПредставление,
					ВыборкаДетальныеЗаписи.СвойствоПредставление,
					КоличествоПоСкладу);
			Иначе
				ШаблонСообщения = НСтр("ru = 'По номенклатуре ""%1"" превышено количество остатка. Остаток: %2'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыборкаДетальныеЗаписи.НоменклатураПредставление, КоличествоПоСкладу);
			КонецЕсли;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоСебестоимость = ВыборкаДетальныеЗаписи.КоличествоСебестоимость; 
		СуммаСебестоимость = ВыборкаДетальныеЗаписи.СуммаСебестоимость;
		
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Управленческий.ПрибылиУбытки;
		Движение.Период = Дата;
		Движение.КоличествоКт = ДокументКоличество;
		Движение.Сумма = ?(Движение.КоличествоКт = КоличествоСебестоимость,
			СуммаСебестоимость,
			СуммаСебестоимость / КоличествоСебестоимость * Движение.КоличествоКт);
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склад] = Склад;
		
		Если ВыборкаДетальныеЗаписи.ЭтоТовар Тогда
			Движение.СчетКт = СчетТовары;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Свойство] = ВыборкаДетальныеЗаписи.Свойство;
		Иначе
			Движение.СчетКт = СчетМатериалы;
		КонецЕсли;
		
		СуммаПродаж = СуммаПродаж + ВыборкаДетальныеЗаписи.ДокументСумма;
	КонецЦикла;
	
	Если Не Отказ Тогда
		// регистр Управленческий 
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Управленческий.Покупатели;
		Движение.СчетКт = ПланыСчетов.Управленческий.ПрибылиУбытки;
		Движение.Период = Дата;
		Движение.Сумма = СуммаПродаж;
	КонецЕсли;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
